benchmarksuite/interfaceCapturing/advection/vortexShearedDiscTet/vortexShearedDiscTet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
	location		"system";
    object          controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interfaceAdvector;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         8;

writeControl    adjustableRunTime;

writeInterval   4;

deltaT          1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       0.05;

functions
{
	volumeFractionError
	{
		type volumeFractionError;
		libs ("libpostProcess.so");
		field alpha.water;
		functionType        cylinder;
		radius          0.15;
		direction       (0 1 0);
		origin 			(0.5 0 0.75);
		writeControl    adjustableRunTime;
		writeInterval   4;
		writePrecision 	16;
	}

	
}


// ************************************************************************* //
